////////////////////////////////////////////////////////////////////////////////////////////
// Задача №1: написать программу, которая заменяет все четные числа в целочисленном статическом массиве на 0. (массив из 10 элементов)

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int arr[10];

	cout << "Введите 10 значений в массив" << endl;
	for (int i(0); i < 10; i++)
	{
		cin >> arr[i];
	}

	for (int i(0); i < 10; i++)
	{
		cout << arr[i] << " ";
	}

	cout << "замена четных чисел в целочисленном статическом массиве на 0" << endl;

	for (int i(0); i < 10; i++)
	{
		if (arr[i] % 2 == 0)
		{
			arr[i] = 0;
		}
	}

	for (int i(0); i < 10; i++)
	{
		cout << arr[i] << " ";
	}
	system("pause");
}

////////////////////////////////////////////////////////////////////////////////////////////
//Задача №2: ввод символа с клавиатуры (с проверкой что это именно символ), ввод строки с клавиатуры (с проверкой что это именно строка).
Вывод в консоль номера, который символ занимает в строке, если он там есть. Если нет — вывод сообщения об отсутствии символа.

#include <iostream>
#include <string>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");


	string simvol; //переменная типа string, отвечающая за символ
	string str; //переменная типа string, отвечающая за строку
	cout << "Введите символ" << endl;
	do //проверка на символ

	{

		getline(cin, simvol);

		if (simvol.length() > 1) cout << "Это не символ, повторите попытку" << endl;

	} while (simvol.length() > 1);
	cout << "!Введён символ!" << endl;


	cout << "Введите строку" << endl;
	do //проверка на строку

	{

		getline(cin, str);

		if (str.length() <= 1) cout << "Один символ не является строкой, повторите попытку" << endl;

	} while (str.length() <= 1);
	cout << "!Введена строка!" << endl;


	int z = 0, from = 0; //переменная z для позиции символа в строке, from для предотвращения зацикливания
	while ((z = str.find(simvol, from)) != string::npos) //испольуется find для поиска символа в строке
	{
		cout << "Символ находится на позиции " << z << endl;
		from = z + 1;
	}
	if (from == 0) cout << "символ отсутствует" << endl;


	system("pause");
	return 0;
}

////////////////////////////////////////////////////////////////////////////////////////////
//Задача №3: расчет определителя матрицы, матрица размером 3 на 3 Ввод чисел построчно. Числа только целые.
#include <iostream>
#include <string>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	const int arr_shape = 3;
	int arr[arr_shape][arr_shape];

	cout << "Введите значения матрицы" << endl;
	for (int i(0); i < 3; i++)
	{
		for (int j(0); j < 3; j++)
		{
			cin >> arr[i][j];
		}
	}

	for (int i(0); i < 3; i++)
	{
		for (int j(0); j < 3; j++)
		{
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}

	cout << "Определитель матрицы" << endl;

	double A = 0;

	A = arr[0][0] * arr[1][1] * arr[2][2] - arr[0][0] * arr[1][2] * arr[2][1]- arr[0][1] * arr[1][0] *arr[2][2] + arr[0][1] * arr[1][2] *arr[2][0]+ arr[0][2] * arr[1][0] * arr[2][1] - arr[0][2] * arr[1][1] * arr[2][0];

	cout << A << endl;

	system("pause");
}
////////////////////////////////////////////////////////////////////////////////////////////